{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform, defining data types (UserProfile, Project, Task, Pledge, Vote, Challenge, PeerRating) and state maps, along with access control initialization and role management functions.",
  "feature_evidence.json": "Feature evidence report mapping three feature IDs (fixing ProjectDetailsDialog, task lifecycle display, and pledge lifecycle display) to their associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, serving as a reference document for the project's frontend component structure.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp with a Toaster for notifications.",
  "frontend/src/components/CompleteProjectButton.tsx": "Button component that allows a project creator to mark a project as completed by calling the useCompleteProject mutation, showing a loading state and toast notifications.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects with fields for title, description, HH estimate, monetary value, resource link, and other-tasks pool HH; disables controls and shows a spinner while the backend actor is initializing.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating tasks within a project, displaying available HH budget (accounting for the Other Tasks pool and already-allocated tasks) and showing confirmed vs. pending pledge HH separately as informational context.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying user scorecards (earned HH, reputation, enabler points) and a tabbed projects list filtered by status (pledging, active, completed), with a create project button.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky header with the IASA logo, app title, and a user dropdown menu showing squad role, earned HH, reputation, and voting power with a logout option.",
  "frontend/src/components/LoginScreen.tsx": "Unauthenticated landing page displaying app branding, a four-feature grid (rewards, collaboration, progress, quality), and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app shell that handles initialization, authentication, and actor-loading states, then renders Header/Dashboard/Footer with a ProfileSetupModal if the user has no profile yet.",
  "frontend/src/components/PeerRatingSection.tsx": "Form component that lets authenticated project participants submit 0–5 star ratings for other participants in a completed project, with mentor ratings carrying 3x weight.",
  "frontend/src/components/PledgeSection.tsx": "Displays and manages project pledges, showing active/expired/reassigned pledge lists with status badges, PM confirmation controls, and a reassign-to-task selector.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a username and squad role to register a new user profile, blocking interaction until submission succeeds.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a project showing pledge progress, prize money, payout per HH, and participant count, with a button to open the details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "A dialog that shows full project details in tabs (tasks, pledges, share-of-pool, peer ratings) and includes a button to complete active projects.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty-state message if none exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Shows each participant's confirmed pledge share, calculated payout from the prize pool, and warns about pending pledges excluded from the calculation.",
  "frontend/src/components/TaskCard.tsx": "Displays a single task with its status, next-step guidance, and action buttons (accept, complete, approve, pledge) based on the caller's role and task state.",
  "frontend/src/components/TasksSection.tsx": "Lists all tasks for a project with a budget banner showing confirmed vs. pending HH, a task lifecycle legend, and a button to create new tasks when the project is active or pledging.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend interactions including user profiles, projects, tasks, pledges, and peer ratings using the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme design tokens including colors, radius, and sidebar variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, known issues, and three existing fix/feature requests related to the ProjectDetailsDialog draft view, task lifecycle display, and pledge lifecycle display."
}