{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform, defining data types (UserProfile, Project, Task, Pledge, Vote, Challenge, PeerRating) and CRUD/action functions with access control and migration support.",
  "backend/migration.mo": "Migration module that transforms old actor state (OldUserProfile without gamification fields) to the new schema (NewUserProfile with totalEnablerPoints, efficiencyBadgesCount, constructivenessRating) during canister upgrade.",
  "feature_evidence.json": "Feature evidence report documenting that ProfileSetupModal.tsx and useQueries.ts were updated to pass the selected SquadRole variant when calling registerUser, with high confidence and linked to test REQ-6.",
  "frontend-file-summaries.txt": "Auto-generated JSON file containing one-sentence summaries of all frontend source files for build planning and documentation purposes.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that wraps the app with ThemeProvider, QueryClientProvider, and InternetIdentityProvider, rendering MainApp and a Toaster notification component.",
  "frontend/src/components/CompleteProjectButton.tsx": "Button component that allows project creators to mark a project as completed, triggering the peer rating window via the useCompleteProject mutation.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form component for creating new projects with fields for title, description, estimated HH, monetary value, and optional resource link, with input validation before submission.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating tasks within a project, validating the HH budget against the remaining project budget calculated from existing tasks.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying user scorecards (earned HH, reputation, enabler points) and a tabbed project list filtered by status (all, pledging, active, completed) with a create project button.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky header with the IASA logo, app title, and a user dropdown menu showing squad role, earned HH, reputation, and voting power with a logout option.",
  "frontend/src/components/LoginScreen.tsx": "Unauthenticated landing page with a feature grid (rewards, collaboration, progress, quality) and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app shell that handles initialization, authentication state, and conditionally renders LoginScreen, the Dashboard layout, or the ProfileSetupModal when a profile is missing.",
  "frontend/src/components/PeerRatingSection.tsx": "Component for submitting 0–5 star peer ratings on a project, listing other participants in a select and displaying existing ratings, with mentor ratings carrying 3x weight.",
  "frontend/src/components/PledgeSection.tsx": "Component that lets users pledge Human Hours to a pledging-status project and displays a list of all current pledges with participant details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a username and squad role from new users and registers them via the useRegisterUser mutation hook.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a single project showing status, prize money, payout per HH, and participant count, with a button to open the full ProjectDetailsDialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "A full-screen dialog showing detailed project info including stats, pledge progress, and tabbed sections for pledging, tasks, peer ratings, and pool share.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty-state message if none exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Calculates and displays each participant's projected monetary payout based on their share of completed-task Human Hours relative to the total pool.",
  "frontend/src/components/TaskCard.tsx": "Displays a single task card with status badge, HH budget, and context-sensitive action buttons (accept, complete, approve, challenge) based on the current user's role.",
  "frontend/src/components/TasksSection.tsx": "Lists all tasks for a project using TaskCard components and conditionally renders CreateTaskDialog and CompleteProjectButton controls for creators and participants.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for interacting with the ICP backend actor, covering user profiles, projects, tasks, pledges, and peer ratings.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the build state of the 'IASA Challenge Sandbox' ICP/Motoko DAO platform, listing architectural notes, existing features, and a 4-step incremental feature roadmap with pending items."
}