{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform defining data types (UserProfile, Project, Task, Pledge, Vote, Challenge, PeerRating) and state maps, with access-control-gated CRUD operations for projects, tasks, pledges, votes, and peer ratings.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of post-login authorization gating in MainApp.tsx, listing the affected files and confirming high confidence that unauthorized users see a friendly message instead of the dashboard.",
  "frontend-file-summaries.txt": "JSON-formatted catalogue of short summaries for every frontend source file, describing each component's purpose and notable recent changes.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp with a Toaster for notifications.",
  "frontend/src/components/CompleteProjectButton.tsx": "Button component that lets a project creator mark a project as completed by calling the completeProject mutation, showing success or error toasts.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects with fields for title, description, estimated HH, monetary value, and an optional resource link, with input validation before submitting.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating tasks within a project, validating the HH budget against the project's remaining pledged HH before submission.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard displaying three user scorecards (Earned HH, Reputation, Enabler Points) and a tabbed project list filtered by status (all, pledging, active, completed).",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice, a heart icon, a link to caffeine.ai, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky top header displaying the IASA logo/title and, when authenticated, a dropdown menu showing the user's avatar, squad role, earned HH, reputation, and voting power with a logout option.",
  "frontend/src/components/LoginScreen.tsx": "Full-page login screen with a feature grid (Earn Rewards, Collaborate, Track Progress, Quality Assurance) and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app orchestrator that handles initialization, authentication, role-based authorization, and conditionally renders LoginScreen, UnauthorizedScreen, ProfileSetupModal, or the main Dashboard layout.",
  "frontend/src/components/PeerRatingSection.tsx": "Displays a form to submit 0–5 star peer ratings for project participants and lists existing ratings, with mentor ratings noted as carrying 3x weight.",
  "frontend/src/components/PledgeSection.tsx": "Allows users to pledge Human Hours to a project during the pledging phase and displays a list of all current pledges with participant details.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to collect a username and squad role (Apprentice, Journeyman, or Mentor) and register their profile.",
  "frontend/src/components/ProjectCard.tsx": "Renders a summary card for a project showing status, pledge progress, prize money, payout per HH, and participant count, with a button to open a details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "Modal dialog displaying full project details including stats, pledge progress, and tabbed sections for pledging, tasks, peer ratings, and pool share distribution.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty state message if no projects exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Displays projected payout distribution among participants based on completed task Human Hours, showing each participant's earned HH, share percentage, and CLP payout.",
  "frontend/src/components/TaskCard.tsx": "Renders a single task card with status badge, HH budget, and context-aware action buttons (accept, complete, approve, challenge) based on the current user's role.",
  "frontend/src/components/TasksSection.tsx": "Lists all tasks for a project with options for the creator to complete the project and for participants to create new tasks when the project is active.",
  "frontend/src/components/UnauthorizedScreen.tsx": "Full-screen unauthorized access page that displays the user's principal ID, instructs them to contact the admin, and provides a logout button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor calls including user profiles, roles, projects, tasks, pledges, and peer ratings.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration mapping OKLCH CSS variables to semantic color tokens, extending theme with custom border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state for the IASA Challenge Sandbox ICP/Motoko DAO platform, recording architectural notes, known issues, completed features, and a 4-step incremental build plan."
}