{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform defining data types (Project, Task, Pledge, Vote, etc.) and state management with ordered maps, plus access control integration for role-based permissions.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (actor availability fix, data loading restore, useActor guard) to their respective files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React component and hook structure.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that wraps the app with ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp and a Toaster for notifications.",
  "frontend/src/components/CompleteProjectButton.tsx": "Button component that allows project creators to mark a project as completed, triggering the peer rating window via the useCompleteProject mutation.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects that checks actor availability via useActor, disabling the trigger button and form fields with a 'Connecting...' spinner until the backend is ready.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating tasks within a project that calculates remaining budget by subtracting the Other Tasks pool HH and existing task budgets from the project total.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying user scorecards (earned HH, reputation, enabler points) and a tabbed projects list filtered by status (all, pledging, active, completed) with a create project button.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky top header showing the IASA logo/title and a user dropdown menu with profile stats (squad role, earned HH, reputation, voting power) and a logout button.",
  "frontend/src/components/LoginScreen.tsx": "Unauthenticated landing page with a feature grid (rewards, collaboration, progress tracking, quality assurance) and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app shell that handles auth state transitions—showing loading spinners, the login screen, profile setup modal, or the full Header/Dashboard/Footer layout depending on identity and profile status.",
  "frontend/src/components/PeerRatingSection.tsx": "Component for submitting and viewing peer ratings within a project, allowing users to select a participant and assign a 0–5 star rating via a form that calls the ratePeer mutation.",
  "frontend/src/components/PledgeSection.tsx": "Displays pledge status and activation progress for a project, listing pending/approved/reassigned pledges and allowing the project creator (PM) to sign off on pledges.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a username and squad role from new users and registers them via the useRegisterUser mutation, blocking interaction until submitted.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a single project showing status, pledge progress, prize money, payout per HH, and participant count, with a button to open the full ProjectDetailsDialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "A tabbed dialog showing full project details including stats, pledge progress, governance notes, and sub-sections for pledging, tasks, peer ratings, and pool share distribution.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty-state message if none exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Calculates and displays each participant's projected payout from the prize pool based on their share of completed-task Human Hours, with a summary card showing totals.",
  "frontend/src/components/TaskCard.tsx": "Renders an individual task card with status badges and action buttons (accept, complete, approve, challenge, pledge) gated by the current user's role, assignment, and task status.",
  "frontend/src/components/TasksSection.tsx": "Lists all tasks for a project, separating regular tasks from the 'Other Tasks' pool, shows remaining HH budget, and provides controls to create tasks and complete the project for authorized users.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend canister, covering user profiles, projects, tasks, pledges, and peer ratings, all gated on actor availability.",
  "frontend/src/index.css": "Global CSS entry point that imports Tailwind directives and defines OKLCH-based CSS custom properties for the design system's light and dark color themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file describing three fix-request features focused on resolving the 'actor not available' error, restoring persisted project/task data loading, and preventing race conditions in actor-dependent React Query hooks."
}