{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform, defining data types (UserProfile, Project, Task, etc.) and implementing access control, participation levels with voting power, and role-compatibility logic.",
  "backend/migration.mo": "Migration module that transforms old actor state (UserProfile without participationLevel) to new state (UserProfile with participationLevel and participationLevelLocked fields) during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (participation level selector, level/voting-power display, admin panel) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing the purpose and key changes of every component and hook in the project.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the root div for the Vite/React application.",
  "frontend/src/App.tsx": "Root React component that wraps the app with ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp and a Toaster for notifications.",
  "frontend/src/components/AdminPanel.tsx": "Admin-only collapsible panel that lists all project participants and allows the administrator to change any user's participation level via a dropdown, guarded by the useIsCallerAdmin hook.",
  "frontend/src/components/CompleteProjectButton.tsx": "Small button component that triggers the completeProject mutation for an active project and shows a success or error toast on completion.",
  "frontend/src/components/CreateProjectDialog.tsx": "A dialog component with a form for creating new projects, collecting fields like title, description, estimated HH, monetary value, and resource link, then submitting via the useCreateProject mutation hook.",
  "frontend/src/components/CreateTaskDialog.tsx": "A dialog component for creating tasks within a project, enforcing HH budget constraints against available project budget and submitting via the useCreateTask mutation hook.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard view displaying user scorecards (participation level, earned HH, reputation) and a tabbed project list filtered by status (pledging, active, completed).",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky header displaying the app logo/title and an authenticated user dropdown menu showing profile info, participation level, stats, and a logout button.",
  "frontend/src/components/LoginScreen.tsx": "Unauthenticated landing page with a feature grid and an Internet Identity login button that triggers the login flow.",
  "frontend/src/components/MainApp.tsx": "Root application shell that handles authentication state, actor readiness, and profile setup gating, rendering either LoginScreen, a loading spinner, or the full app layout with Header, Dashboard, AdminPanel, and Footer.",
  "frontend/src/components/PeerRatingSection.tsx": "Renders a form allowing authenticated project participants to rate other participants (0–5 stars) within a project, submitting ratings via the `useRatePeer` mutation with toast feedback.",
  "frontend/src/components/PledgeSection.tsx": "Displays and manages project pledges grouped by status (active, expired, reassigned), allowing the PM to confirm pending pledges and reassign general-pool pledges to specific tasks.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering a username and selecting a participation level and squad role, then registering via the `useRegisterUser` mutation.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a project showing status, pledge progress, prize money, payout per HH, and participant count, with a button to open the full project details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "Dialog that shows full project details in a tabbed layout (tasks, pledges, share of pool, peer ratings) and includes a complete-project button for active projects.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of `ProjectCard` components for a list of projects, or an empty-state message if no projects exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Displays a project's share-of-pool breakdown, showing each participant's confirmed pledge amount, percentage share, and estimated payout from the prize pool. Filters out pending/expired pledges and renders a per-participant row with profile lookup.",
  "frontend/src/components/TaskCard.tsx": "Renders an individual task card with status badges, next-step guidance, and action buttons (accept, complete, approve, pledge, confirm) based on the current user's role (PM, assignee, mentor) and task lifecycle state.",
  "frontend/src/components/TasksSection.tsx": "Displays the full tasks list for a project, including a budget banner with confirmed/pending HH totals, a task lifecycle legend, and a grid of TaskCard components with an optional CreateTaskDialog for PMs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including queries for user profiles, projects, tasks, and pledges, as well as mutations for creating/updating each entity.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties (design tokens) for light and dark themes using OKLCH color values, covering backgrounds, foregrounds, primary/accent/destructive colors, sidebar, and chart colors.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider for server state and InternetIdentityProvider for authentication context wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and box shadow, defines accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file (version 3) describing a participation/voting system with four levels (Apprentice, Journeyman, Master, Guest Artist) and corresponding voting powers, listing existing implemented features and pending architectural requirements."
}