{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge app that wires together AccessControl and UserApproval modules, exposing endpoints for role assignment, approval requests, and user status queries with a hardcoded admin principal fallback.",
  "feature_evidence.json": "Feature evidence report documenting the three-step non-admin onboarding gate implementation in MainApp.tsx, mapping it to test ID REQ-2 and listing the relevant files and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, describing each component's purpose and notable implementation details.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the React app via /src/main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp with a Toaster for notifications.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component that lists approved users and allows the admin to view and update each user's participation level via a dropdown, with collapsible sections and approval status management.",
  "frontend/src/components/CompleteProjectButton.tsx": "Small button component that triggers the completeProject mutation for a given project and shows a success or error toast on completion.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects that checks actor readiness before enabling the trigger button and form fields, then submits project data via the createProject mutation.",
  "frontend/src/components/CreateTaskDialog.tsx": "A dialog component for creating new project tasks, validating title and HH budget inputs against available project budget, and submitting via the useCreateTask mutation.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard view displaying user scorecards (participation level, earned HH, reputation) and a tabbed project list filtered by status (pledging, active, completed).",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky top header showing the app logo/title and a user dropdown menu with profile details (participation level, voting power, earned HH, reputation) and a logout action.",
  "frontend/src/components/LoginScreen.tsx": "Landing/login screen with a feature grid and an Internet Identity login button for unauthenticated users.",
  "frontend/src/components/MainApp.tsx": "Root application shell that gates rendering based on authentication and approval status, showing login, access-request, pending-approval, profile-setup, admin panel, or the main dashboard as appropriate.",
  "frontend/src/components/PeerRatingSection.tsx": "Renders a form allowing authenticated project participants to rate other participants (0–5 stars) within a project, submitting ratings via the `useRatePeer` mutation with toast feedback.",
  "frontend/src/components/PledgeSection.tsx": "Displays and manages project pledges grouped by status (active, expired, reassigned), allowing the PM to confirm pending pledges and reassign general-pool pledges to specific tasks.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering a username and selecting a participation level and squad role, then registering via the `useRegisterUser` mutation.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a single project showing status, pledge progress, prize money, payout per HH, and participant count, with a button to open the full project details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "Dialog that shows full project details in a tabbed layout (tasks, pledges, share of pool, peer ratings) and includes a complete-project button for active projects.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of `ProjectCard` components for a list of projects, or an empty-state message if no projects exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Displays each confirmed pledge participant's share of the project prize pool, calculated from confirmed/approved pledges only, with a warning banner about excluded pending pledges.",
  "frontend/src/components/TaskCard.tsx": "Renders a single task card with status badges, lifecycle action buttons (accept, complete, approve, pledge, confirm), and role-aware next-step guidance for PM, assignee, and mentor.",
  "frontend/src/components/TasksSection.tsx": "Lists all project tasks grouped into regular and 'Other Tasks', shows a HH budget banner with confirmed/pending breakdowns, and provides a task-creation dialog for eligible project statuses.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout helpers, delegation validation, and an AuthClient wrapper, exposed via the useInternetIdentity hook and InternetIdentityProvider component.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including queries for user profiles, projects, tasks, and pledges, as well as mutations for creating/updating them.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties (oklch color tokens) for both light and dark themes, including sidebar, chart, and UI component variables.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider (React Query) and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps oklch CSS variables to semantic color tokens, extends border radius and box shadow, adds accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, architectural notes, known issues, existing features, and pending fix requests — specifically documenting a broken non-admin 3-step onboarding flow introduced after version 13."
}