{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge platform, defining data types (Project, Task, Pledge, Vote, Challenge, PeerRating, UserProfile) and state management with ordered maps, plus access control integration and helper functions like `isProjectParticipant`.",
  "feature_evidence.json": "Feature evidence report linking the PledgeSection remaining-budget display and form validation feature to its implementation file, test ID, and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the project's React component structure and functionality.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp with a Toaster for notifications.",
  "frontend/src/components/CompleteProjectButton.tsx": "Button component that allows project creators to mark a project as completed, triggering the peer rating window and showing success/error toasts.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects with fields for title, description, estimated HH, monetary value, resource link, and an Other Tasks Pool HH field, with validation ensuring pool HH does not exceed total estimated HH.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating project tasks that calculates remaining budget by subtracting the Other Tasks pool HH and existing task budgets from the total, enforcing the budget cap with validation errors.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying three user scorecards (Earned HH, Reputation, Enabler Points) and a tabbed project list filtered by status (all, pledging, active, completed) with a Create Project button.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice, a heart icon, a link to caffeine.ai, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky top header displaying the IASA logo/title and, when authenticated, a dropdown menu showing the user's avatar, squad role, earned HH, reputation, and voting power with a logout option.",
  "frontend/src/components/LoginScreen.tsx": "Full-page login screen with a feature grid (Earn Rewards, Collaborate, Track Progress, Quality Assurance) and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app component that handles initialization, authentication state, and conditionally renders the LoginScreen, the main layout (Header/Dashboard/Footer), or the ProfileSetupModal.",
  "frontend/src/components/PeerRatingSection.tsx": "Displays a form for rating fellow project participants (0–5 stars) and lists existing peer ratings, using project participant data and the ratePeer mutation.",
  "frontend/src/components/PledgeSection.tsx": "Shows pledge management for a project, including activation progress, pending/approved/reassigned pledge lists, budget tracking, and a sign-off action for the project creator.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create their profile by entering a username and selecting a squad role, then calling the registerUser mutation.",
  "frontend/src/components/ProjectCard.tsx": "Displays a summary card for a project with status badge, pledge progress, prize money, payout per HH, and participant count, with a button to open a details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "Full-screen dialog showing detailed project info including stats, pledge progress, and tabbed sections for pledging, tasks, peer ratings, and pool share distribution.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty-state message if none exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Shows projected payout distribution among participants based on completed task Human Hours, including a summary card with totals and per-participant share rows.",
  "frontend/src/components/TaskCard.tsx": "Displays an individual task card with status, pledge info, and action buttons (accept, complete, approve, challenge, pledge) based on the current user's role.",
  "frontend/src/components/TasksSection.tsx": "Lists all tasks for a project with budget tracking, separates the 'Other Tasks' pool, and provides controls for creating tasks and completing the project for the creator.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state and persisting identity across page reloads using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor interactions including user profiles, projects, tasks, pledges, and peer ratings.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines light/dark mode CSS custom properties (oklch color tokens) for the design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration mapping oklch CSS variables to semantic color tokens, extending theme with custom border radius, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing two pending feature requests: a frontend PledgeSection budget cap display/validation (AR-1) and a backend pledge validation to reject pledges exceeding the maximum HH budget (AR-2)."
}