{
  "backend/main.mo": "Main Motoko actor for the IASA Challenge app implementing access control, user approval, squad roles, participation levels, projects, tasks, pledges, peer ratings, and reputation scoring. Orchestrates all backend logic with role-based permission checks throughout.",
  "feature_evidence.json": "Feature evidence report identifying a fix for the authentication/connection flow for non-admin users logging in via Internet Identity, pointing to MainApp.tsx and useQueries.ts as the affected files.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the build planning process.",
  "frontend/index.html": "HTML entry point for the frontend app, setting the page title to 'IASA Challenge (Alpha Sandbox) v0.3' and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, QueryClientProvider, and InternetIdentityProvider, then renders MainApp with a Toaster for notifications.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component allowing administrators to view user profiles, manage participation levels, and handle user approval requests with collapsible sections and status badges.",
  "frontend/src/components/CompleteProjectButton.tsx": "Small button component that triggers the completeProject mutation and shows a toast notification when a project is marked as completed.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog form for creating new projects with fields for title, description, HH estimates, monetary value, and resource link; disables controls while the backend actor is initializing.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog form for creating tasks within a project, displaying available HH budget (excluding the Other Tasks pool and already-allocated tasks) and separating confirmed vs. pending pledge HH informationally.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying user stats (participation level, earned HH, reputation) in scorecards and a tabbed view of projects filtered by status (pledging, active, completed).",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright, a caffeine.ai attribution link, and the app version string.",
  "frontend/src/components/Header.tsx": "Sticky top header showing the IASA logo, app title, and an authenticated user dropdown menu with profile info, participation level badge, and logout action.",
  "frontend/src/components/LoginScreen.tsx": "Unauthenticated landing page displaying app branding, a four-feature grid (rewards, collaboration, progress, quality), and an Internet Identity login button.",
  "frontend/src/components/MainApp.tsx": "Root app shell that sequences through loading/auth states (initializing, unauthenticated, connecting, verifying) and renders LoginScreen, AdminPanel, Dashboard, or approval-request UI based on identity and access status.",
  "frontend/src/components/PeerRatingSection.tsx": "Form component that lets the current user select a fellow project participant and submit a 0–5 star peer rating for a completed project.",
  "frontend/src/components/PledgeSection.tsx": "Displays and manages pledges for a project, allowing PMs to confirm pledges and reassign them to specific tasks, with status badges and totals for active, expired, and reassigned pledges.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for new users to set up their profile by entering a username and selecting a participation level and squad role, then registering via the backend.",
  "frontend/src/components/ProjectCard.tsx": "Renders a summary card for a project showing pledge progress, prize money, payout per HH, and participant count, with a button to open the full project details dialog.",
  "frontend/src/components/ProjectDetailsDialog.tsx": "A dialog that shows full project details in a tabbed layout including tasks, pledges, share-of-pool, and peer ratings, with a complete-project action for active projects.",
  "frontend/src/components/ProjectsTab.tsx": "Renders a responsive grid of ProjectCard components for a list of projects, or an empty-state message if no projects exist.",
  "frontend/src/components/ShareOfPoolSection.tsx": "Displays each participant's share of the prize pool based on their confirmed pledged HH, showing percentage share and estimated payout while excluding pending and expired pledges.",
  "frontend/src/components/TaskCard.tsx": "React component that renders a single task card with status badges, action buttons (accept, complete, approve, pledge, confirm), and role-aware next-step guidance for project managers, assignees, and mentors.",
  "frontend/src/components/TasksSection.tsx": "React component that displays the full tasks section for a project, including a budget banner, task lifecycle legend, and a list of TaskCard components with an optional CreateTaskDialog for PMs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, covering user profiles, approval, projects, tasks, pledges, votes, challenges, and peer ratings via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind CSS and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3) for the IASA Challenge app, noting that admin access works but external non-admin users (e.g. jedvogdt@gmail.com) cannot connect, with a fix in progress."
}