{
  "kind": "build_request",
  "title": "Enforce maximum HH budget cap on pledges",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the backend, when a user submits a pledge for a project, validate that the total pledged HH (sum of all existing approved + pending pledges for that project, plus the new pledge amount) does not exceed the project's maximum HH budget. If the new pledge would cause the total to exceed the budget, reject it with a descriptive error message.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it is important that pledges can be made only up to the maximum HH budget"
        ]
      },
      "acceptanceCriteria": [
        "A pledge that would cause total pledged HH to exceed the project's max HH budget is rejected with an error.",
        "A pledge that fits within the remaining HH budget is accepted normally.",
        "A pledge of exactly the remaining HH budget is accepted.",
        "A pledge of zero or negative HH is still rejected by existing validation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the PledgeSection frontend component, display the remaining available HH budget (max HH budget minus total already pledged HH) and disable or prevent submission of the pledge form when the entered amount exceeds the remaining budget. Show a clear inline error or warning when the user attempts to exceed it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it is important that pledges can be made only up to the maximum HH budget"
        ]
      },
      "acceptanceCriteria": [
        "The pledge input field shows the maximum allowed value (remaining HH budget).",
        "Submitting a pledge amount greater than the remaining budget is blocked in the UI with a visible error message.",
        "The remaining budget is recalculated and displayed correctly after each new pledge is approved or added.",
        "When the project has no remaining HH budget, the pledge form is disabled and shows a 'Budget fully pledged' message."
      ]
    }
  ],
  "constraints": [
    "Do not change the project creation or task creation budget validation logic.",
    "All Motoko logic must remain in the single main actor (backend/main.mo)."
  ],
  "nonGoals": [
    "Changing how the HH budget itself is set during project creation.",
    "Adding voting or reputation logic.",
    "Modifying task-level budget enforcement."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}