{
  "kind": "build_request",
  "title": "Fix draft dialog and clarify task/pledge/approval lifecycle flow",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the ProjectDetailsDialog (draft view) so that it opens correctly when triggered from a ProjectCard. Investigate and resolve any rendering or state error that prevents the dialog from mounting in the current deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it is not working (draft does not open)"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Open' or the details button on any ProjectCard opens the ProjectDetailsDialog without errors.",
        "The dialog renders all tabs (Tasks, Pledges, Share of Pool, Peer Ratings) without crashing.",
        "The dialog opens for projects in all statuses (drafting, pledging, active, completed)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Tasks section and TaskCard components, clearly display the sequential lifecycle conditions for a task: (1) Task is created by PM in 'open' state; (2) A participant pledges HH hours to the task (pledge status = 'pending'); (3) PM confirms the pledge (pledge status = 'confirmed'); (4) Once the task has sufficient confirmed pledges, the PM can set the task to 'inProgress'; (5) The assignee marks the task as 'completed'; (6) PM approves the task completion (task status = 'approved'). Each state transition should be visually distinct with a status badge or label.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "simply clarify the conditions (sequence) of tasks, pledge and respective approval"
        ]
      },
      "acceptanceCriteria": [
        "Each TaskCard shows the current task status (open, inProgress, completed, approved) as a clearly labelled badge.",
        "Action buttons on TaskCard are only shown when the task is in the correct state for that action (e.g., 'Pledge' only when task is open, 'Approve' only when task is completed).",
        "A short inline label or tooltip on each TaskCard explains what the next required step is (e.g., 'Awaiting pledge confirmation by PM').",
        "The task lifecycle sequence is visually readable without needing external documentation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the PledgeSection component, clearly display the sequential lifecycle conditions for a pledge: (1) Participant submits a pledge (status = 'pending', not counted in confirmed budget); (2) PM reviews and confirms the pledge (status = 'confirmed', now counted in HH budget and Share of Pool); (3) If not confirmed within the expiry window, pledge becomes 'expired'. Show each pledge with its current status and indicate what action is needed next (e.g., 'Awaiting PM confirmation').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "simply clarify the conditions (sequence) of tasks, pledge and respective approval"
        ]
      },
      "acceptanceCriteria": [
        "Each pledge entry in PledgeSection shows a status badge: 'Pending', 'Confirmed', or 'Expired'.",
        "Pending pledges display a note such as 'Awaiting PM confirmation — not yet counted in budget'.",
        "Confirmed pledges display a note such as 'Confirmed — included in HH budget and payout calculation'.",
        "Expired pledges are visually de-emphasised and labelled 'Expired'.",
        "PM-only confirm/reject buttons are visible only for pending pledges and only to the PM."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend data model or pledge/task status enumerations.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All lifecycle labels and status badges must reflect actual backend state — do not introduce UI-only pseudo-states."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing the Motoko actor logic.",
    "Implementing auto-expiry of pledges (deferred to a future request).",
    "Changing the overall visual theme or layout of the dashboard."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}