{
  "kind": "build_request",
  "title": "Fix external user (non-admin) login and connection issue",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the authentication and connection flow so that external (non-admin) users such as jedvogdt@gmail.com can successfully log in and access the app via Internet Identity at https://iasa-challenge-har.caffeine.xyz/. The issue may stem from error handling or state transitions after login for users who are not administrators. Do NOT alter any admin-related logic, admin access flow, or any other existing app functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I still cannot connect as an external user (jedvogdt@gmail.com). Please fix the access problem, DONT CHANGE ANYTHING WITHIN THE APP OR FOR THE ADMINISTRATOR ACCESS (WHICH IS WORKING)"
        ]
      },
      "acceptanceCriteria": [
        "A non-admin user (e.g. jedvogdt@gmail.com) can log in via Internet Identity without encountering a connection error or blank/stuck screen.",
        "After login, a non-admin user is directed to the correct screen (pending approval UI, profile setup, or dashboard) depending on their approval status.",
        "Admin login flow and admin panel access remain fully unchanged and functional.",
        "No other existing app features or UI are modified."
      ]
    }
  ],
  "constraints": [
    "Do NOT change any admin-related logic, admin access flow, or admin panel functionality.",
    "Do NOT modify any other existing app features or UI.",
    "Do NOT change the backend data model or any backend logic unrelated to the connection/auth flow.",
    "Immutable frontend paths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui) must not be edited."
  ],
  "nonGoals": [
    "Changing any admin authentication or authorization logic.",
    "Modifying app features, UI design, or content.",
    "Backend schema migrations.",
    "Adding new features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}