{
  "kind": "build_request",
  "title": "Define and enforce participant identity / access control",
  "projectName": "IASA Challenge Sandbox",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Define a stable allowlist of authorized participant principals in the backend actor. Provide an initial seed mechanism (e.g., a stable variable `authorizedPrincipals: [Principal]` or a `TrieSet`/`HashMap` of trusted principals) so that only recognized ICP identities associated with grupo.iasa.cl can call state-mutating functions such as `registerUser`, `createProject`, `pledgeHours`, `createTask`, `completeTask`, and `submitPeerRating`. Callers not in the allowlist must receive a `#Unauthorized` or descriptive error variant rather than a trap.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "actor no valid? have you well defined who is participating? eg. simple every grupo.iasa.cl ID"
        ]
      },
      "acceptanceCriteria": [
        "A stable data structure (e.g., `allowedPrincipals`) is declared in the actor and survives upgrades.",
        "An admin-only `addParticipant(p: Principal)` and `removeParticipant(p: Principal)` function exist so authorized principals can be managed at runtime.",
        "The actor has an initial deployer/admin principal hardcoded or set during `preupgrade`/`postupgrade` so the allowlist is never empty on first deploy.",
        "Every state-mutating public function checks membership in the allowlist and returns an error (not a trap) for unauthorized callers.",
        "A public query `isParticipant(p: Principal): Bool` is exposed so the frontend can check eligibility before showing the registration flow.",
        "Read-only query functions (e.g., `getUserProfile`, `getProjects`) remain accessible to all principals."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Update `MainApp.tsx` to call the `isParticipant` query after a user authenticates via Internet Identity. If the authenticated principal is not in the allowlist, display a clear, user-friendly message (e.g., 'Your identity is not yet authorized for this platform. Please contact the IASA administrator.') instead of rendering the `ProfileSetupModal` or `Dashboard`. Do not block the login flow itself — only gate the post-login content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "actor no valid? have you well defined who is participating? eg. simple every grupo.iasa.cl ID"
        ]
      },
      "acceptanceCriteria": [
        "After login, `isParticipant` is called with the authenticated principal.",
        "If `isParticipant` returns `false`, a dedicated 'Not Authorized' screen or inline message is shown instead of the app shell.",
        "If `isParticipant` returns `true`, the existing flow (ProfileSetupModal or Dashboard) continues unchanged.",
        "The unauthorized message is clear, professional, and mentions contacting an administrator.",
        "Loading state is handled gracefully while the `isParticipant` query is in flight."
      ]
    }
  ],
  "constraints": [
    "Do not remove or break any existing stable variables or state already in the actor.",
    "Access control must use a Result or variant error — never an uncaught trap — for unauthorized callers.",
    "Read-only query functions must remain publicly accessible without allowlist restriction.",
    "Frontend immutable paths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui) must not be modified."
  ],
  "nonGoals": [
    "Implementing email-based or OAuth identity verification tied to the grupo.iasa.cl domain.",
    "Automatic on-chain lookup or verification of grupo.iasa.cl email addresses.",
    "Changes to the existing SquadRole, UserProfile, or gamification data model.",
    "Any new project, task, or pledge features beyond access control."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}