{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Define and enforce participant identity / access control",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Check participant allowlist after authentication and show authorization status to user",
      "acceptanceCriteria": [
        "After login, `isParticipant` is called with the authenticated principal.",
        "If `isParticipant` returns `false`, a dedicated 'Not Authorized' screen or inline message is shown instead of the app shell.",
        "If `isParticipant` returns `true`, the existing flow (ProfileSetupModal or Dashboard) continues unchanged.",
        "The unauthorized message is clear, professional, and mentions contacting an administrator.",
        "Loading state is handled gracefully while the `isParticipant` query is in flight."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MainApp.tsx",
          "operation": "modify",
          "description": "Add a call to `isParticipant` query after authentication. If the query returns `false`, render an UnauthorizedScreen component instead of ProfileSetupModal or Dashboard. Ensure proper loading state handling while the `isParticipant` check is in flight. The existing authentication flow and ProfileSetupModal logic remain unchanged when the user is authorized."
        },
        {
          "path": "frontend/src/components/UnauthorizedScreen.tsx",
          "operation": "create",
          "description": "Create a new component that displays a clear, professional message when an authenticated user is not in the participant allowlist. The message should state 'Your identity is not yet authorized for this platform. Please contact the IASA administrator.' and include the IASA logo from `frontend/public/assets/generated/iasa-logo-transparent.dim_200x200.png`. Use Tailwind styling consistent with LoginScreen component. Include a logout button so unauthorized users can switch identities."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new `useIsParticipant` query hook that calls the backend `isParticipant` method with the authenticated principal. The hook should be enabled only when the actor is available and the user is authenticated. Return loading, error, and data states. Use the same pattern as other query hooks in this file for consistency."
        }
      ]
    }
  ]
}