{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix external user (non-admin) login and connection issue",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the authentication and connection flow so that external (non-admin) users can successfully log in and access the app via Internet Identity without encountering connection errors or blank screens",
      "acceptanceCriteria": [
        "A non-admin user (e.g. jedvogdt@gmail.com) can log in via Internet Identity without encountering a connection error or blank/stuck screen.",
        "After login, a non-admin user is directed to the correct screen (pending approval UI, profile setup, or dashboard) depending on their approval status.",
        "Admin login flow and admin panel access remain fully unchanged and functional.",
        "No other existing app features or UI are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MainApp.tsx",
          "operation": "modify",
          "description": "Review and fix the authentication state flow in MainApp to ensure non-admin users are properly routed after login. The component currently sequences through loading, auth, approval, and profile states. Add robust error handling for approval status checks and profile loading failures. Ensure the pending-approval UI is shown correctly when isCallerApproved returns false. Add error boundaries or fallback states for cases where backend queries fail during the post-login sequence. Verify the component does not get stuck in a loading state when approval or profile queries encounter errors. Keep all admin-related logic unchanged."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useIsCallerApproved and useGetCallerUserProfile query hooks to ensure they handle errors gracefully and do not cause the UI to freeze or show blank screens. Add retry logic with appropriate retry counts (e.g., retry: 1) and staleTime configuration to prevent infinite loading states. Ensure the enabled flag correctly waits for actor availability. Add onError callbacks to log failures without breaking the UI flow. Verify that approval status queries return proper boolean values and do not throw unhandled exceptions that could leave users stuck on a blank screen."
        },
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Review the login button implementation to ensure error handling is robust when login succeeds but subsequent backend calls (approval check, profile fetch) fail. Add a fallback error message or retry mechanism if the user successfully authenticates but cannot proceed to the next screen. Ensure the component does not rely solely on MainApp's state transitions and provides user feedback if something goes wrong during the post-login flow."
        }
      ]
    }
  ]
}