{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix draft dialog and clarify task/pledge/approval lifecycle flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix ProjectDetailsDialog so it opens correctly when triggered from ProjectCard without rendering or state errors",
      "acceptanceCriteria": [
        "Clicking 'Open' or the details button on any ProjectCard opens the ProjectDetailsDialog without errors.",
        "The dialog renders all tabs (Tasks, Pledges, Share of Pool, Peer Ratings) without crashing.",
        "The dialog opens for projects in all statuses (drafting, pledging, active, completed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProjectDetailsDialog.tsx",
          "operation": "modify",
          "description": "Investigate and fix the dialog mounting issue. Verify the open prop is properly handled, ensure all state initialization is safe (e.g., null-check project data before rendering tabs), add error boundaries if needed, and confirm the Dialog component from shadcn/ui is correctly wired with the open state. Test that the dialog can mount for projects in all statuses without crashing."
        },
        {
          "path": "frontend/src/components/ProjectCard.tsx",
          "operation": "modify",
          "description": "Verify the button click handler correctly sets the dialog open state and passes the correct project data to ProjectDetailsDialog. Ensure no conflicting state updates or event handlers prevent the dialog from opening."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Clearly display the sequential lifecycle conditions for tasks with visually distinct status badges and action buttons that reflect the current state",
      "acceptanceCriteria": [
        "Each TaskCard shows the current task status (open, inProgress, completed, approved) as a clearly labelled badge.",
        "Action buttons on TaskCard are only shown when the task is in the correct state for that action (e.g., 'Pledge' only when task is open, 'Approve' only when task is completed).",
        "A short inline label or tooltip on each TaskCard explains what the next required step is (e.g., 'Awaiting pledge confirmation by PM').",
        "The task lifecycle sequence is visually readable without needing external documentation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add a prominent status badge component that maps TaskStatus enum values to user-friendly labels (e.g., 'proposed' → 'Open', 'inProgress' → 'In Progress', 'completed' → 'Completed', 'taskConfirmed' → 'Approved'). Use distinct colors for each status. Add conditional logic to show action buttons only when the task is in the correct state: show 'Pledge' only when status is 'proposed', 'Accept' only when status is 'taskConfirmed' and user is not assigned, 'Complete' only when status is 'inProgress' and user is the assignee, 'Approve' only when status is 'completed' and user is the PM, 'Confirm' only when status is 'proposed' and user is the PM. Add a next-step indicator (e.g., inline label or tooltip) that explains the required action based on the current status and role (e.g., 'Awaiting pledge confirmation by PM', 'Awaiting task acceptance', 'Awaiting completion by assignee', 'Awaiting PM approval')."
        },
        {
          "path": "frontend/src/components/TasksSection.tsx",
          "operation": "modify",
          "description": "Update the budget info banner to clarify that pending pledges are not yet counted in the confirmed HH budget. Add a legend or tooltip explaining task lifecycle states if needed to support the TaskCard changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clearly display the sequential lifecycle conditions for pledges with status badges and next-action indicators",
      "acceptanceCriteria": [
        "Each pledge entry in PledgeSection shows a status badge: 'Pending', 'Confirmed', or 'Expired'.",
        "Pending pledges display a note such as 'Awaiting PM confirmation — not yet counted in budget'.",
        "Confirmed pledges display a note such as 'Confirmed — included in HH budget and payout calculation'.",
        "Expired pledges are visually de-emphasised and labelled 'Expired'.",
        "PM-only confirm/reject buttons are visible only for pending pledges and only to the PM."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PledgeSection.tsx",
          "operation": "modify",
          "description": "Add a status badge component for each pledge that maps PledgeStatus enum values to user-friendly labels ('pending' → 'Pending', 'confirmed' → 'Confirmed', 'expired' → 'Expired'). Use distinct colors for each status. For pending pledges, add an inline note: 'Awaiting PM confirmation — not yet counted in budget'. For confirmed pledges, add a note: 'Confirmed — included in HH budget and payout calculation'. For expired pledges, apply a muted/greyed-out visual style and label them 'Expired'. Ensure PM-only confirm/reassign buttons are only visible for pending pledges and only to the project creator (PM). Update the section header or intro text to explain the pledge lifecycle sequence: (1) Participant submits pledge (pending), (2) PM confirms pledge (confirmed, counted in budget), (3) Expired if not confirmed in time."
        },
        {
          "path": "frontend/src/components/ShareOfPoolSection.tsx",
          "operation": "modify",
          "description": "Add a note at the top of the section clarifying that only confirmed pledges are included in the share-of-pool calculation, and pending/expired pledges are excluded. This reinforces the pledge lifecycle for users viewing their potential payout."
        }
      ]
    }
  ]
}