{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix non-admin onboarding: Apply → Admin Approves → Member Accesses",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Implement three-step non-admin onboarding gate in MainApp.tsx: show 'Apply for Access' screen for new users, 'Pending Approval' holding screen for submitted requests, and normal app flow for approved members",
      "acceptanceCriteria": [
        "A first-time authenticated non-admin user sees an 'Apply for Access' screen with a submit button.",
        "After submitting an access request, the user is immediately shown a 'Pending Approval' holding screen.",
        "An approved member is routed directly into the app (ProfileSetupModal if new, then Dashboard).",
        "Administrator users are not affected — their flow is unchanged.",
        "LoginScreen, Dashboard, AdminPanel, and all other components are not modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MainApp.tsx",
          "operation": "modify",
          "description": "After authentication and admin check, query getCurrentUserStatus() to determine the user's approval state. Route non-admin users based on status: (a) 'unapproved' → render ApplyForAccessScreen inline component with a button that calls requestApproval() mutation, then refetch status; (b) 'pending' → render PendingApprovalScreen inline component displaying a holding message with no actions; (c) 'approved' → proceed to existing ProfileSetupModal check and Dashboard flow. Keep the admin flow (isCallerAdmin check) completely unchanged. Do not modify any other component imports or rendering logic for LoginScreen, Dashboard, or AdminPanel."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetCurrentUserStatus query hook that calls actor.getCurrentUserStatus() and returns the Variant_unapproved_admin_pending_approved enum. Add useRequestApproval mutation hook that calls actor.requestApproval() and invalidates the 'currentUserStatus' query key on success. Ensure both hooks follow the existing pattern (enabled when actor is available, proper error handling)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify AdminPanel approval section surfaces pending access requests from REQ-2 and that approving them sets status to approved",
      "acceptanceCriteria": [
        "Pending access requests from new users appear in the AdminPanel approval list.",
        "Approving a request in the AdminPanel allows that user to enter the app on their next access.",
        "AdminPanel layout and all other admin functionality remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Review the existing approval section to confirm it already uses useListApprovals and useSetApproval hooks from useQueries.ts. Verify that pending requests submitted via requestApproval() appear in the list and that calling setApproval(user, 'approved') correctly updates the user's status. If the UI does not clearly indicate the approved status change, add a toast notification on successful approval. Do not restructure the component or modify the user management section."
        }
      ]
    }
  ]
}